def g(h):
    """Ускорение свободного падения от высоты"""
    return 5.58847218e-13 * h**2 - 3.08249938e-06 * h + 9.80663919


def sound_speed(h):
    """Скорость звука от высоты"""
    return -2.43265270e-8 * h**2 - 3.82778332e-3 * h + 340.289478


def ro(h):
    """Плотность воздуха от высоты"""
    return 4.14972281e-9 * h**2 - 1.17790055e-4 * h + 1.22534716


def Cy(alpha):
    """Коэффециент подъёмной силы Cy от угла атаки alpha (при delta = 20)"""
    return 0.0834 * alpha + 0.3579


def Cx(Cy, M):
    """Коэффециент лобового сопротивления Cx от коэффециента подъёмной силы Cy
    при разных значениях числа маха М"""
    if M <= 0.5:
        return 0.0752 * Cy**2 - 0.0129 * Cy + 0.0178
    elif 0.5 < M <= 0.75:
        return 0.0407 * Cy**2 + 0.013 * Cy + 0.0168
    elif 0.75 < M <= 0.82:
        return 0.1275 * Cy**2 - 0.0332 * Cy + 0.0262
    elif 0.82 < M <= 0.85:
        return 0.196 * Cy**2 - 0.0559 * Cy + 0.0289
    elif M > 0.85:
        return 0.1261 * Cy**2 - 0.0004 * Cy + 0.0272


def P_h(M, H):
    """Тяга двигателя P от скорости полета M
    при разных значениях высот H"""
    if 0 <= H <= 4000:
        P = -5000.0 * M + 9417
    elif 4000 < H <= 6000:
        P = -2424.48 * M + 7334
    elif H > 6000:
        P = -1228.57 * M + 5520

    return P * 9.81 * 1.05

